tap "chef/chef"
tap "cloudfoundry/tap"
tap "datadog-labs/pack"
tap "datadog/lapdog"
tap "go-delve/delve"
tap "infisical/get-cli"
tap "steipete/tap"
tap "thoughtbot/formulae"
tap "withgraphite/tap"
brew "aom"
brew "aribb24"
brew "asciinema"
brew "aspell"
brew "autoconf"
brew "awscli"
brew "boost"
brew "btop"
brew "c-ares"
brew "cairo"
brew "cjson"
brew "coreutils"
brew "dav1d"
brew "double-conversion"
brew "edencommon"
brew "eksctl"
brew "emacs"
brew "ffmpeg"
brew "fish"
brew "fnm"
brew "libnghttp3"
brew "libngtcp2"
brew "libuv"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-lfs"
brew "glances"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "ncurses"
brew "htop"
brew "imagemagick"
brew "ipython"
brew "krb5"
brew "kubernetes-cli"
brew "libpq"
brew "libyaml"
brew "lua"
brew "openjdk"
brew "maven"
brew "neovim"
brew "nushell"
brew "openai-whisper"
brew "pkgconf"
brew "pnpm"
brew "postgresql@14"
brew "postgresql@16"
brew "pulumi"
brew "python@3.13"
brew "rbenv"
brew "rcm"
brew "ripgrep"
brew "rtk"
brew "ruby", link: false
brew "shellcheck"
brew "speedtest-cli"
brew "sqlfluff"
brew "temporal"
brew "vim"
brew "watchman"
brew "yarn"
brew "z"
brew "zig"
brew "zsh"
brew "datadog-labs/pack/pup"
brew "datadog/lapdog/lapdog"
brew "infisical/get-cli/infisical"
brew "withgraphite/tap/graphite"
cask "android-platform-tools"
cask "codex"
cask "codexbar"
cask "dbeaver-community"
cask "gcloud-cli"
cask "jordanbaird-ice"
cask "ngrok"
cask "orbstack"
cask "t3-code"
cask "youtube-downloader"
vscode "connor4312.nodejs-testing"
vscode "coolbear.systemd-unit-file"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "janisdd.vscode-edit-csv"
vscode "mattn.lisp"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.live-server"
vscode "mtxr.sqltools"
vscode "qufiwefefwoyn.inline-sql-syntax"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "skyran.js-jsx-snippets"
vscode "tamasfe.even-better-toml"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "yoavbls.pretty-ts-errors"
npm "@posthog/cli"
npm "codebuff"
npm "corepack"
npm "happy-coder"
